# encoding: utf-8
if Gem.win_platform?
  Encoding.default_external = Encoding.find(Encoding.locale_charmap)
  Encoding.default_internal = __ENCODING__

  [STDIN, STDOUT].each do |io|
    io.set_encoding(Encoding.default_external, Encoding.default_internal)
  end
end

# Игра "Волшебный шар"
# Массив вариантов приветствия
greetings = [
  "Привет, дорогой друг. Отвечаю на твой вопрос...",
  "Здравствуй, смертный. Сегодня для тебя такой ответ:",
  "Кто вопрошает - тот получит ответ:"
  ]

# Массив вариантов ответа
answers = [
  # Положительные
  "Бесспорно",
  "Предрешено",
  "Никаких сомнений",
  "Определённо да",
  "Можешь быть уверен в этом",
	
  # Нерешительно положительные
  "Мне кажется — «да»",
  "Вероятнее всего",
  "Хорошие перспективы",
  "Знаки говорят — «да»",
  "Да",

  # Нейтральные
  "Пока не ясно, попробуй снова",
  "Спроси позже",
  "Лучше не рассказывать",
  "Сейчас нельзя предсказать",
  "Сконцентрируйся и спроси опять",
  
  # Отрицательные
  "Даже не думай",
  "Мой ответ — «нет»",
  "По моим данным — «нет»",
  "Перспективы не очень хорошие",
  "Весьма сомнительно"
  ]

puts
# Случайный выбор вариантов приветствия
puts greetings.sample
sleep 2

puts
# Вывод случайного варианта ответа
puts answers.sample
sleep 2

puts
puts "Есть еще вопросы?"
